{
  "Version": "1.3",
  "ID": "f16j6sdtz2ziowvam56a6wizfqssv3g7m6gsr55ya",
  "Issue Number": "27",
  "Client": {
    "Name": "Mapxus",
    "Region": "Hong Kong",
    "Industry": "Web3 / Crypto",
    "Website": "https://www.mapxus.com/",
    "Social Media": "@mapxus",
    "Social Media Type": "Other",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "Smart and simple indoor mapping, for everyone.\r\nAn average person can spend up to 90% of their time in indoor environments. Yet, isn’t it radical that major location-oriented solutions in the market are still exclusive to outdoor environments?\r\n\r\nA map is a product that touches all points of our lives. Not only does it help us get to one place from another, a map also helps us build and understand the world we exist in, no matter outdoors or indoors.\r\n\r\nMapxus is an all-rounded PropTech solutions partner in indoor mapping applications. We put people first, and we are dedicated to empowering people, businesses, and cities through creating a barrier-free and inclusive urban environment.\r\n\r\nWe help to fulfill smart mobility through closing the gap between digital maps and indoor environments, to revolutionize our interactions with the physical space, as well as to deliver a comfortable, intuitive, and seamless indoor-outdoor experience for everyone.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "1.Indoor Mapping Data\r\n•Content: Geometric information of indoor maps (e.g., floor plans, path information, points of interest (POI) data).\r\n2.Spatial Interaction Data\r\n•Content: Connection point data between indoor and outdoor environments, such as stairs, elevators, and entrances.\r\n3.Accessibility Data\r\n•Content: Information related to accessible environments (e.g., wheelchair ramps, elevator availability, tactile paving locations).\r\n4.Data Analytics Results\r\n•Content: Analytical data generated from indoor navigation interactions, such as foot traffic statistics and hotspot analysis.\r\n5.User-Generated Content\r\n•Content: Feedback or annotations submitted by users, such as suggested path improvements or corrections to mapping errors.\r\n6.Multimedia Files\r\n•Content: Images or videos related to indoor navigation (e.g., photos of mall signboards, reference images for shop locations).",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "Since our data is currently stored in our own storage containers, my main task will be organizing and classifying the data, such as geometric data, interactive data, and accessibility data, ensuring that each category has a clear structure and proper labels during storage.\r\n\r\nFor tools, I might use the following:\r\n•Python: Writing cleaning scripts to process redundant data and remove empty data points.\r\n•QGIS: Utilizing geographic information system tools to clean and optimize indoor map shapefiles.\r\n•FFmpeg: Performing format conversion and compression for multimedia files.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://www.youtube.com/channel/UCRedstTGCuRPUmwEiiprurQ",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "1.5 to 2 years",
    "In which geographies do you plan on making storage deals": "Greater China, Africa, North America",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, IPFS",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f01531188-hongkong\r\nf03238633-Singapore\r\nf03241413-dongguan\r\nf03241759-guangzhou",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "4PiB",
    "Single Size Dataset": "500TiB",
    "Replicas": 8,
    "Weekly Allocation": "800TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2024-12-18 08:40:08.960300768 UTC",
    "Validated By": "NDLABS-Leo",
    "Active": true,
    "Updated At": "2024-12-18 08:40:08.960297711 UTC",
    "Active Request ID": "9940d084-f280-491f-85b3-30d2abdac4f3",
    "On Chain Address": "f16j6sdtz2ziowvam56a6wizfqssv3g7m6gsr55ya",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "7ce7b2b9-2e9f-4600-8799-0edc5b08e18e",
      "Request Type": "First",
      "Created At": "2024-11-12 08:49:01.754565346 UTC",
      "Updated At": "2024-11-12 08:49:01.754567141 UTC",
      "Active": false,
      "Allocation Amount": "400TiB",
      "Signers": [
        {
          "Github Username": "NDLABS-Leo",
          "Signing Address": "f1yayfsv6whu3rheviucvventj3y6t542xfpb47ei",
          "Created At": "2024-11-12 08:51:10.301000000 UTC",
          "Message CID": "bafy2bzacedzborsqbukrtovw7bxxv4xd7ehb3d4zuqsz2346vlp3jugz3jod2"
        }
      ]
    },
    {
      "ID": "85b3521a-8107-46c8-96b2-bcd954abe75e",
      "Request Type": "Refill",
      "Created At": "2024-12-13 10:25:05.617872866 UTC",
      "Updated At": "2024-12-13 10:25:05.617873766 UTC",
      "Active": false,
      "Allocation Amount": "800TiB",
      "Signers": [
        {
          "Github Username": "NDLABS-Leo",
          "Signing Address": "f1yayfsv6whu3rheviucvventj3y6t542xfpb47ei",
          "Created At": "2024-12-13 10:26:40.717000000 UTC",
          "Message CID": "bafy2bzacebw37uutwlqcsb4la5hr7otgwrxdsx4xbiuhn4wf3ausfga5di2ok"
        }
      ]
    },
    {
      "ID": "9940d084-f280-491f-85b3-30d2abdac4f3",
      "Request Type": "Refill",
      "Created At": "2024-12-18 08:39:04.828159239 UTC",
      "Updated At": "2024-12-18 08:39:04.828160188 UTC",
      "Active": false,
      "Allocation Amount": "800TiB",
      "Signers": [
        {
          "Github Username": "NDLABS-Leo",
          "Signing Address": "f1yayfsv6whu3rheviucvventj3y6t542xfpb47ei",
          "Created At": "2024-12-18 08:40:10.182000000 UTC",
          "Message CID": "bafy2bzacebmiagk5ebvnqmhiwtac4lfepvt6rio3kvsbuc3b6dejisohmuoka"
        }
      ]
    }
  ]
}