{
  "Version": "1.3",
  "ID": "f1vcu3cdlccqiriow46lzjtlnc32fu5clgcchgwza",
  "Issue Number": "21",
  "Client": {
    "Name": "eteamxr",
    "Region": "Hong Kong",
    "Industry": "Arts & Recreation",
    "Website": "https://eteamxr.com/about-us-vr-ar-mr-xr/",
    "Social Media": "ETeam XR",
    "Social Media Type": "Facebook",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "Our Story\r\nEteam is an award-winning production house specializing in the design and development of extended reality(XR).\r\n\r\nIn 2019, we set out to create quality XR experiences for everyone. Combining the AR, VR and MR technology, we opened our first arcade at MOKO Shopping Complex in Hong Kong. It was the first and ever XR escape room in Asia. From the storyline to decorations, it provides players with an immersive and cinematic experience.\r\n\r\nOver the years, our team of specialists in game design and programming and 3D animations has provided innovative solutions by incorporating XR technologies that help international businesses in different industries to set themselves apart from the rest.\r\n\r\nAchievements and Awards\r\nFirst XR Arcade in Asia 2019\r\nCyberport Incubation Entrepreneur 2019\r\nHong Kong ICT Awards 2020 -  Silver Awards  (Entertainment & eSports Software)\r\nHong Kong Most Valuable Brand Awards 2021- The Best XR Game Design and Development\r\n2022 Business GOVirtual Tech Awards - Excellence Award (Startup Tech Company of the Year)\r\nNEXXCREATE Digital Entertainment Awards 2022 - Top 10 Excellence in Start-up Innovation Awards (NFT, Web3 & Metaverse)",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "The data types we intend to store include the following:\r\n\r\n1.3D Models and Rendering Data: We have a large collection of high-quality 3D models, textures, and rendering data. This includes geometric information, materials, lighting effects, and other details essential for creating realistic visual representations.\r\n\r\n2.Video and Image Assets: Primarily used in XR content production and playback, we rely on high-resolution video and image data. This includes 360-degree videos, panoramic photos, and static augmented reality images that help present detailed and immersive scenes.\r\n\t\r\n3.Audio Data: For AR/VR experiences, we utilize 3D and spatial audio. This includes environmental sound effects, background music, and audio files associated with specific objects to enhance the immersive experience.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "We mainly need to convert, pack and slice the files to optimise storage and retrieval efficiency.\r\n1, Firstly, we will adjust the format of 3d models to a smaller format according to the need, in addition, we will encode videos and images in a compatible format.\r\n2、We will mainly use the car format to divide large files into multiple small files.\r\n3、Additionally for data transfer",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://promo.eteamxr.com/?_ga=2.120786763.298555481.1730705868-1200659074.1730705867",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Monthly",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America",
    "How will you be distributing your data to storage providers": "Cloud storage (i.e. S3), HTTP or FTP server",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f02984331 --Australia \r\nf02883857 -- Singapore \r\nf02852273 -- United Kingdom \r\nf02973061 -- Russia\r\nf02889193---Vietnam",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "5PiB",
    "Single Size Dataset": "500TiB",
    "Replicas": 10,
    "Weekly Allocation": "1PiB"
  },
  "Lifecycle": {
    "State": "Submitted",
    "Validated At": "",
    "Validated By": "",
    "Active": true,
    "Updated At": "2024-11-04 08:53:11.434255996 UTC",
    "Active Request ID": "",
    "On Chain Address": "f1vcu3cdlccqiriow46lzjtlnc32fu5clgcchgwza",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": []
}